Revit 2027 API
IFCGeometryInfo Methods
The IFCGeometryInfo type exposes the following members.
Methods
Name | Description
CreateCurveGeometryInfo |  Creates a new container object which holds IfcCurve handles processed from a Revit geometry object.
CreateFaceGeometryInfo(Double) |  Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
CreateFaceGeometryInfo(Double, Boolean) |  Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
CreateFaceGeometryInfo(ExporterIFC, Plane, XYZ, Double, Boolean) |  Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
CreateSurfaceGeometryInfo |  Creates a new container object which holds IfcSurface handles processed from a Revit geometry object.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCurves |  Gets the IfcCurve handles created representing the processed geometry and stored in this object.
GetFaces |  Gets the IfcFace handles created representing the processed geometry and stored in this object.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetRepresentations |  Gets the representation handles created representing the processed geometry and stored in this object.
GetSurfaces |  Gets the IfcSurface handles created representing the processed geometry and stored in this object.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
IFCGeometryInfo Class
Autodesk.Revit.DB.IFC Namespace